{
  "id": "1993392274567475568",
  "url": "https://x.com/johncoogan/status/1993392274567475568",
  "timestamp": "2025-11-25T18:52:08.000Z",
  "capturedAt": "2025-11-25T22:23:13.585Z",
  "author": "John Coogan @johncoogan",
  "authorName": "John Coogan",
  "authorHandle": "@johncoogan",
  "text": "Yesterday, Anthropic released Claude Opus 4.5 and it delivered strong results across major benchmarks (SOTA on ARC-AGI, SWE-Bench, Computer Use, etc.). The model performed especially well on coding tasks. Gemini 3 had just set high bars in nearly every benchmark but the one that it couldn’t really crack was SOTA performance in coding (worse than Sonnet 4.5 on SWE-Bench Verified).\n\nIt feels like Anthropic is a real lesson in the value of focus, the team hasn’t spread its attention across multiple (frankly quite lucrative) opportunities in productizing a leading AI foundation model (or lab that churns them out). The long-term thesis is still this idea that coding prowess will deliver AGI. The clarity there has created a talent magnet, a focused product in a profitable and new (but enormous) market, and staved off attacks from bigger companies with more funding.\n\nThey haven’t even launched an AI image generator. Sholto Douglas, a researcher at Anthropic who came on the show yesterday, had a funny quote about it: “We believe there is no shortage of AI images.” Now to be clear, Anthropic does think that image understanding is important. Just as you’d want your human coworker to be able to look at the website they are building and see the results, Claude can look at a screenshot and understand what’s going on.\n\nAlso notable is that they didn’t vaguepost about the launch. This strategy was basically created by OpenAI to create buzz around new launches and honestly it’s a lot of fun. I still think it’s funny to read into what Sam meant by posting a Death Star picture before launching GPT-5. DeepMind recently picked up the practice of vague posting and had some fun with it, but Anthropic eschewed the opportunity and ran a pretty by the book launch plan. A blog post with some clear benchmarks, a video explaining some of the results and early findings, etc.\n\nOn AI safety, I’ve shifted my thinking a lot over the past year. I’ve come to appreciate safety research because of its applications related to understanding foreign influence that may occur from open-source models and the effects of long chatbot discussions with people who are under psychological stress. Neither of these scenarios was on my list of potential negative side effects years ago, but now they seem very real and worth taking seriously. Yesterday, Sholto highlighted a tradeoff Anthropic has been wrestling with around biology. No one wants a terrorist to build a bioweapon in their garage, but we all want top cancer researchers to be able to accelerate their workflows with helpful AI assistants. It’s very hard to put concrete timelines together for negative scenarios like “AI helps someone create a bioweapon” but I think it’s very good to have companies wrestling with these issues early and often.\n\nIt’s clear that all that moral wrestling is a cultural feature, not a bug. The most widely viewed clip from our interview with Sholto was about Anthropic’s writing-focused culture. Apparently Dario is regularly posting essays on Slack threads explaining his full chain of thought on various issues facing the company. Shawn Wang from Cognition said, “this is the single strongest reason to join ant i have ever read.”\n\nTyler on our team had some extra thoughts on the day, saying “Anthropic still feels very underhyped. Google is just now receiving its flowers in the public markets, and OpenAI has taken up most of the AI mindshare since the original ChatGPT launch. If you are AGI-pilled, Anthropic is probably where you want to work.”",
  "avatar": "johncoogan/avatar/avatar.jpg",
  "avatarPath": "johncoogan/avatar/avatar.jpg",
  "images": [],
  "jsonFile": "johncoogan/tweets/1993392274567475568_2025-11-25-18-52-08.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "johncoogan"
}