{
  "id": "1995204368144924749",
  "url": "https://x.com/deanwball/status/1995204368144924749",
  "timestamp": "2025-11-29T14:00:26.000Z",
  "capturedAt": "2025-11-30T21:21:02.777Z",
  "author": "Dean W. Ball @deanwball",
  "authorName": "Dean W. Ball",
  "authorHandle": "@deanwball",
  "text": "Joshua is right. In my view there are a few reasons for this:\n\n1. Left epistemics favor expert endorsement; it is often hard for the Democratic elite to align around a new idea until the “correct” academics have signed off. In the case of AI that is unlikely because concepts like AGI are not taken seriously in academia, including by many within the field of machine learning. To the extent things like eg concentration of power are taken seriously by the left, they are invariably seen through the rather conventional lens of corporate power, money in politics, etc. \n\n2. There are also “the groups,” who do not help. AGI invites conversation about the direction of humanity writ large; there is no particular angle on AGI for “the teachers union,” or most other interest groups. This makes it hard for AI to hold their attention, other than as a threat to be dealt with through occupational licensing regulations (which they favor anyway). \n\n3. Many on the progressive left hold as foundational the notion that Silicon Valley is filled with vapid morons whose lack of engagement with <the relevant humanities literature> means they will never produce something of world-historical import. Accepting that “transformative AI” may well be built soon by Silicon Valley is thus very challenging for those of this persuasion. \n\nIt is very hard for most Democrats to articulate what advanced AI would cause them to do differently beyond the policy agenda they’ve had for a long time. This is because outside of national security (a bipartisan persuasion), they have no answer to this question, because they do not take advanced AI seriously. Whereas Bannon, say what you will about him, can articulate a great many things America should do differently because of AI. \n\nThe result of all this is that the left is largely irrelevant on most matters related to AI, outside of important but narrow issues like SB 53. Even this bill though lacks a good “elevator pitch” to the American taxpayer. It’s a marginal accretion of technocratic regulation, not a vision (this isn’t a criticism of 53, just a description of it). \n\nRecently I was chatting with a Democratic elected official, and he said “the problem [the Democratic Party] has is nobody knows where we stand on AI.” I replied that the problem is that nobody *cares* where they stand.",
  "avatar": "deanwball/avatar/avatar.jpg",
  "avatarPath": "deanwball/avatar/avatar.jpg",
  "images": [],
  "jsonFile": "deanwball/tweets/1995204368144924749_2025-11-29-14-00-26.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "deanwball"
}