{
  "id": "2009419312298430860",
  "url": "https://x.com/nateberkopec/status/2009419312298430860",
  "timestamp": "2026-01-09T00:17:51.000Z",
  "capturedAt": "2026-01-12T23:23:38.504Z",
  "author": "Dean W. Ball @deanwball",
  "authorName": "Dean W. Ball",
  "authorHandle": "@deanwball",
  "text": "Have said it before, and I’ll say it again: professional SWEs are among the worst positioned to derive utility from coding agents. All the baggage associated with the concept of “shipping software” to third-party users (most of it good and healthy, btw) does indeed slow productivity down. If you think of the ideal output of a coding agent as “highly polished software, produced within a few hours, for imminent use by thousands or millions,” I submit you’re kind of missing the point. \n\nImagine if the tweet below were from a writer saying models were causing mass psychosis among other writers because they created the “performance of writing essays” rather than “shipping great essays to readers.”\n\nAs a professional writer, I’d respond that you’re kind of missing the point. No, a language model cannot one shot an essay I would feel comfortable publishing—indeed, in my case, I literally never use a single word of LLM output in my writing. Yet I use LLMs to *inform* my writing every day.\n\nI have questions about the world. I use tools to answer them. I have many more tools, and much better ones too, than I did one month ago or three months ago or a year ago, to say nothing of the distant past before the reasoning models, 15 months ago.\n\nEveryone, in their professional and personal lives, has questions that coding agents can help to answer, projects to prototype, ideas to test. \n\nWith time, the existence of coding agents will make many people’s questions more coding-agent-shaped. Just as once your questions were Encyclopedia-shaped, and once they were Wikipedia-shaped, Stack-Overflow-Shaped, Google-Shaped, and so on.\n\nCoding-agent-shaped problems are higher dimensional than any of these earlier shapes, but they still *do* have a shape. \n\nThe broad observation about this new shape of problem is not so much that code writing can be automated but instead that anyone can now harness ~all the infrastructure, instrumentation, libraries, primitives, and so on of professional software engineering to arbitrary ends, including those far afield from what the term “software engineering” connotes in popular discourse. Most people have no idea about these things (not even don’t know how to use them but literally don’t know they exist at all), so there is a massive capability overhang here; scripts unwritten, complex software features used, latent productivity untapped, and, ultimately, problems unsolved and ideas untried.\n\nThe enthusiasm you are seeing from non-coders is them tapping into all of this. Doing so does not require shipping software built to the standards of a commercial software engineering enterprise.\n\nCoding agents *can* produce production-ready software, to be clear. Not “looks production-ready,” but actually production-ready. In fact I was mocked by one or two pretend-smart-people a few weeks ago for saying a website CMS with Squarespace-esque features was too much for Opus. “This is easy,” they said, on the same kind of AI mania the quoted post describes. \n\nEasy to one shot a believable prototype? Yes. But to produce a polished final version took days of iteration, if not longer. This is how it should be! It’s shipping software. It’s a canvas with *your name* on it. If you care, it will take time to get it right. \n\nAlthough it is worth noting that it takes orders of magnitude less time than it used to for an engineer, and for someone like me it has gone from being functionally impossible to doable in a week or two as a tertiary-priority side project.\n\nProfessional SWEs are among those most inclined to miss all of this and just get angry that they still have a job.",
  "avatar": "deanwball/avatar/avatar.jpg",
  "avatarPath": "deanwball/avatar/avatar.jpg",
  "images": [],
  "jsonFile": "deanwball/tweets/2009419312298430860_2026-01-09-00-17-51.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "deanwball"
}