{
  "id": "1994497454385901808",
  "url": "https://x.com/sebkrier/status/1994497454385901808",
  "timestamp": "2025-11-28T20:03:43.000Z",
  "capturedAt": "2025-11-28T21:18:47.779Z",
  "author": "Séb Krier @sebkrier",
  "authorName": "Séb Krier",
  "authorHandle": "@sebkrier",
  "text": "It's annoying that a lot of instinctive 'no AI in art' reactions come from crowds who barely engage with art, or when they do it's just occasionally going to Cafe Oto and buying some cringe candles from a Bushwick shop. I sympathise with the disgust at boring one shot prompted fluorescent Bored Ape infused aesthetic images, and painful EDM slop with soulless vocals from Suno - but there are plenty of really interesting art collectives who produce very cool/novel art using AI in creative and non-lazy ways. \n\nObsessing over whether a particular tool is used is pointless; there's plenty of bad music with lazy sampling and cliche progressions, bad Warhol inspired paintings in Soho galleries for tasteless crowds, and artisanal movies produced for basic pattern matchers. The issue isn't whether AI is used or not, but how, for what purpose, as part of what kind of process, and so on. The instinctive \"if AI = bad\" automated reaction is just lazy. Good to be discerning, but if your criteria for evaluating art is an IF-THEN algorithm, I'm afraid you too are a bot.\n\nWhat *is* true is that the marginal cost of Al slop is effectively zero, so flooding the world with it is infuriating. I do cringe when I see a yellowish ChatGPT generated Ghiblified image on a Substack. But this is an inevitable consequence of lowering the barriers of production. Imo the future will require better walled gardens, offline spaces, better matching algorithms, a greater role for tastemakers, and a proliferation of subcultures. In many ways this has been the case when electronic music no longer required analog gear and giant expensive synths; virtual instruments lowered barriers, but there's more quality music than ever if you know where to look.",
  "avatar": "sebkrier/avatar/avatar.jpg",
  "avatarPath": "sebkrier/avatar/avatar.jpg",
  "images": [],
  "jsonFile": "sebkrier/tweets/1994497454385901808_2025-11-28-20-03-43.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "sebkrier"
}