{
  "id": "2006512808104702370",
  "url": "https://x.com/gdb/status/2006512808104702370",
  "timestamp": "2025-12-31T23:48:27.000Z",
  "capturedAt": "2026-01-01T23:47:20.451Z",
  "author": "Greg Brockman @gdb",
  "authorName": "Greg Brockman",
  "authorHandle": "@gdb",
  "text": "Looking back on AI progress in 2025: people are increasingly weighing how AI should fit into our lives and how vital it is for the United States to lead in its development. Being pro-AI does not mean being anti-regulation. It means being thoughtful — crafting policies that secure AI’s transformative benefits while mitigating risks and preserving flexibility as the technology continues to evolve rapidly.\n\nThis year, my wife Anna and I started getting involved politically, including through political contributions, reflecting support for policies that advance American innovation and constructive dialogue between government and the technology sector. These views are grounded in a belief that the United States must work closely with builders, researchers, and entrepreneurs to ensure AI is developed responsibly at home and that we remain globally competitive.\n\nAI has the potential to democratize entrepreneurship and the American dream, make healthcare more affordable and effective, provide access to high-quality education, accelerate scientific discovery, expand economic opportunity, and strengthen national competitiveness and security. We feel this potential personally; through Anna’s experience navigating the healthcare system with complex chronic conditions that don’t fit neatly into any specialty, we’ve seen firsthand how AI can empower people and lead to better health outcomes. AI represents an opportunity to truly improve healthcare, one we shouldn’t squander.\n\nWe’ve been encouraged by the growing seriousness with which policymakers in Washington are approaching US leadership in AI, which we’ve long believed depends on optimism, curiosity to explore, and serious infrastructure development. As I expressed at a recent White House technology leaders’ dinner, it’s been great to see the president’s and his administration’s willingness to engage directly with the AI community and approach emerging technology with a growth-focused mindset and goal of helping to ensure continued US leadership in AI and supporting American economic competitiveness.\n\nWe believe that AI can be a force to improve quality of life for every human (and for every animal). Excited for the progress 2026 will bring!",
  "avatar": "gdb/avatar/avatar.jpg",
  "avatarPath": "gdb/avatar/avatar.jpg",
  "images": [],
  "jsonFile": "gdb/tweets/2006512808104702370_2025-12-31-23-48-27.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "gdb"
}