{
  "id": "2006310012747162052",
  "url": "https://x.com/RichardSocher/status/2006310012747162052",
  "timestamp": "2025-12-31T10:22:37.000Z",
  "capturedAt": "2025-12-31T14:41:19.387Z",
  "author": "Richard Socher @RichardSocher",
  "authorName": "Richard Socher",
  "authorHandle": "@RichardSocher",
  "text": "AI Predictions for 2026 and Beyond\n1. We'll see the first Reward Engineering jobs - As AI agents gain capabilities to accomplish longer-term goals, prompts become inadequate. Reward engineers will precisely define what success and failure look like across extended time horizons, anticipating all the ways an agent might accomplish goals in unintended ways. They'll need to describe and manage AI with zero ambiguity for complex goals while avoiding suboptimal reward hacking by people and AI.\n2. The AI wave is undeniable, but not every AI company succeeds - AI is as foundationally important as electricity. But that doesn't mean every startup, data center, or valuation is correct. It's a big, large, messy wave. But overall, based on first principles, AI will eventually enable the largest companies in the next decade. Just as in previous technology waves like electricity - some companies went bankrupt because they were set up incorrectly or had bad leadership, but we're going to use more electricity and more energy. You can measure the sophistication of a country by how much electricity it is able to produce and make use of. The same thing is true for AI and intelligence.\n3. AI backlash and benefits both under and overestimated simultaneously - Some underestimate the backlash, others overestimate negatives and underestimate that productivity raises all boats. Countries will use it for surveillance; others will use it for good. AI is only as good as the people and systems that build it. As part of this we will see larger parts of even modern countries off-ramp from innovation. Multiple Luddite waves and a new type of "we're doing well enough" stagnation vibes will take hold in many people.\n4. Continued pushback against agents on the web slows adoption - Murky human incentive structures create friction. Advertisements economics do not like web agents doing work for users. Hourly-paid jobs (lawyers, etc.) don't have incentives for massive productivity increases until major disruption (like full stack AI legal firms) happens.\n5. AI missteps stay constant in absolute numbers - AI is getting better (lower error rate) but usage frequency is much higher. These cancel out, maintaining steady public misstep counts.\n6. At least three jobs will start seeing displacement of people unwilling or unable to use AI, starting with software developers - How many people do you still know that say "I'm not good with this computer thing" in the workplace? How many people can still say "I'm not good with this whole internet thing"? None, right? The same thing will happen with "I'm not good with this whole agent delegation thing." That will be an impossible thing to say five to ten years from now, just like it's impossible now to say "I'm not good with computers" in high-paying knowledge work jobs. There are going to be two to three jobs where that is already going to happen this year, starting with software engineering, and eventually it'll be any job.\n7. The Lump of Labor Fallacy gets proven again - Work isn't zero-sum. When tractors automated farming, new industries emerged. 150 years ago, 90% worked in agriculture; today 5% feed the world. AI is driving a similar transformation for knowledge work. Every wave of automation has created more jobs than it eliminated—not instantly, not without disruption, but the overall pie grows. New opportunities create new desires because humans get used to their baseline and then want more above it.\n8. Every knowledge worker becomes a manager of AI agents - The majority of people are individual contributors now, but AI requires everyone to learn management skills: delegating with clear language, building trust, understanding when AI hallucinates. This is a transition to working at higher levels of abstraction, similar to how programmers moved from Assembly to C++ to Python to now working directly in English. With similarly messy and lossy abstraction issues. The ultimate such abstraction level will be agency.\n9. 10-person unicorn companies become possible - While one-person unicorns are unrealistic, 10-person unicorns will emerge due to incredibly high revenue per employee efficiency. You need people with domain expertise who know how to manage agents effectively.\n10. At least a dozen companies will raise billion-dollar seed rounds in 2026 — not companies being valued at a billion, but companies raising a billion at seed stage. Maybe we can call one a Pegasus?\n11. By the end of the year, we're going to see the first glimpse of where super intelligence might go. It will require open-endedness and recursively self-improving AI. AI that innovates throughout the research process (think discovery, implementation, experimentation, etc). Self improvement is a term being thrown around a lot but nobody has actually figured it out yet in its fullest form. It'll be the most exciting research area moving forward.\n12. Search infrastructure remains essential no matter how good models get Every single call to an LLM calls out to search - even if it was already trained on that data. Even as models get more specialized data, they're still going to need search over it. Any advanced models trained on specialized data for specific industries will need search infrastructure. you . com is building this for more and more large companies.\n13. Industry-specific agents unlock significant revenue through vertical search - Companies will go deep into vertical domains—legal, healthcare, news, hospitality—with specialized agents enabled by search over niche datasets not easily accessible on the public web.\n14. Browsers evolve but remain relevant - AI will first use existing consumer technologies like browsers as infrastructure, then eventually build custom versions made for AI. We're already seeing this with search.\n15. Open source will lead closed source on many benchmarks - This already happened with DeepSeek and will continue, surprising many people and pushing pressure on pure LLM API companies.\n16. Music changes forever if copyright issues get solved - Suno is taking off. If someone cracks the copyright problem, music transforms completely.\n17. Short-form AI video content explodes - Marketing budgets increase while production costs for small ads decrease dramatically.\n18. First humanoid robots roll out as household novelty - Initial deployments will be gimmicky, creating some disillusionment, but useful rollouts are still 2-3 years away. If humanoids truly had AGI like capabilities, they could also transform any car into a self-driving car by driving in the driver’s seat... Tech is not going to get there this year.\n19. New marketing motion: market directly to LLMs - As agents make purchasing decisions, companies will need to optimize for AI consumption, not just human eyes.\n20. Drugs will get to market more quickly - We'll see more drugs reaching the market faster through AI-accelerated development and approval processes. The FDA continues to support this with approvals of new methods like organoids which will allow AI to experiment faster and with less animal suffering.\n21. AI will be to biology what calculus was to physics - AI is a new kind of language that can deal with complexity. Physics has beautiful short equations, but there's no beautiful short equation for your microbiome or the human brain - it's a messy system that evolved over millions of years with all these bugs and viruses in it. We use a lot of metaphors and verbiage from biology for computers too. But now with AI, we can handle that complexity. We're entering an era of new programmable biology where we can engineer biological processes to be much better than how they occur in nature, making biology exciting as an engineering science rather than just memorization.\n24. AI achieves superhuman capability in more verifiable/simulate-able domains - Chess and Go were obvious—you can simulate infinitely and verify outcomes. Once we improve simulations for domains like biology, AI will dominate those too, potentially curing cancer and extending healthy lifespans. Not next year but we'll see progress on various dimensions of e.g. virtual cells.",
  "avatar": "richardsocher/avatar/avatar.jpg",
  "avatarPath": "richardsocher/avatar/avatar.jpg",
  "images": [],
  "jsonFile": "richardsocher/tweets/2006310012747162052_2025-12-31-10-22-37.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "richardsocher"
}