{
  "id": "1999978315856441719",
  "url": "https://x.com/JosephPolitano/status/1999978315856441719/photo/2",
  "timestamp": "2025-12-13T23:02:42.000Z",
  "capturedAt": "2025-12-17T18:20:21.782Z",
  "author": "Joey Politano @JosephPolitano",
  "authorName": "Joey Politano",
  "authorHandle": "@JosephPolitano",
  "text": "Trying to do some synthesis on the perpetually ongoing EU-US growth discourse here:\n\n1) Undeniable at this point that the US economy has grown faster than the EU as a whole over the last 6 years. The US has grown ~5% more on a per-capita basis since pre-COVID. But importantly, this is mostly a recent phenomenon; pre-COVID growth was basically even between the US & EU\n\n2) When Americans talk about \"the EU\" in practice they're often only thinking of major Western European countries like France, Germany, and Italy, which have had some of the lowest growth on the continent, and are ignoring the rest of the EU, which have had better growth numbers. \n\n3) Some of the fastest-growing major EU members (like Poland) even rival some of the faster-growing US states (like North Carolina). But no majors in the EU have grown as fast as Texas, Florida, Arizona, Washington, etc. The only places in the EU that rival the growth of the fastest-growing parts of the US are small countries like Ireland, Cyprus, Malta, Croatia, etc where growth is mostly driven by tourism or tax shifting\n\n4) This is extra bad because most EU countries are not as rich as the US. The bar for a country like Italy should not just be to *match* US growth, it should be to exceed it and then eventually catch up to US GDP/capita.\n\n5) It's true that if you adjust for working hours, European countries are much closer in productivity to the US & some of America's recent growth advantage is mitigated. But the post-COVID growth gap is not closed by *that* much—the US having fewer vacations and longer working hours is a phenomenon that has predated the recent growth disparity. I also wouldn't put *too* much faith in these numbers just because measuring working hours is difficult (especially post-COVID) & methodologies vary a ton by country\n\n6) Europeans still perform much better on social indicators like life expectancy (this is one area where the post-COVID gap has opened up in the opposite direction, with the US falling behind). They tend to have lower inequality and higher employment rates, so that the median American has closer living standards to the median EU citizen than would be suggested by looking just at GDP/capita. But post-COVID median income growth has also been weak in the EU.\n\nSo I think 1) There's an undeniable gap in US-EU growth 2) People underrate how recent a phenomenon this is 3) Americans tend to overstate the size of this gap by focusing on the EU countries that have the worst recent growth 4) Adjusting for working hours & the EU's larger social safety net closes some of the recent gap in incomes 5) even after adjusting, there's a significant US-EU growth gap",
  "avatar": "josephpolitano/avatar/avatar.jpg",
  "avatarPath": "josephpolitano/avatar/avatar.jpg",
  "images": [
    "media/1999978315856441719_G8FJ-gqXQAMqee0",
    "media/1999978315856441719_G8FMAxwWUAUIrR0",
    "media/1999978315856441719_G8FMRYPXoAMe14S",
    "media/1999978315856441719_G8FElroXYAYh1yo"
  ],
  "jsonFile": "josephpolitano/tweets/1999978315856441719_2025-12-13-23-02-42.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "josephpolitano"
}