{
  "id": "1990485471038714097",
  "url": "https://x.com/redtachyon/status/1990485471038714097",
  "timestamp": "2025-11-17T18:21:32.000Z",
  "capturedAt": "2025-11-27T23:59:48.328Z",
  "author": "Ariel @redtachyon",
  "authorName": "Ariel",
  "authorHandle": "@redtachyon",
  "text": "It really feels like ICLR 2026 is a pivotal moment for the beginning of the collapse of the ML peer review system. Complaints about bad reviews and bad papers have always been around, but not nearly to this extent. \n\nThe annoying thing about the conference system is that to criticize it, you need to first be successful in it - else you're just a sore loser. I've had successes and failures in various conferences, some reasonable, some weird. I don't claim to be an authority, but I do claim to be passionate about the field and have a vested interest in its success.\n\nGrowing up as a lil' science nerd, I loved the idea of peer review - fellow respected scientists gathering to check whether a paper is legit, suggesting changes to make it better, working together in the pursuit of Science.\n\nThis, of course, is not the reality. I'm not old enough to make a diagnosis as for how and when it happened. But the cat is out of the bag, and we're stuck in this mess, at least until some respected scientist/organization proposes a new paradigm - either drastically more closed, or drastically more open.\n\nThe modern conference model is a randomized scarcity measure, and I really mean it. It's random - the NeurIPS consistency experiment shows that painfully clearly. It is also, by design, a scarcity tactic - conferences generally target a fixed percentage of accepted papers, also accounting for venue limits. Quality of the papers is secondary, and \"good paper, reject\" is a perfectly acceptable outcome.\n\nThe only thing that keeps this system alive is a vague vibe of prestige among some (fewer each day) researchers, and institutional lock-in by dinosaurs in academia.\n\nIs there a better way? I don't know. I see two paths. Either (a) we move to a radically more open paradigm, where everyone puts their papers on neoarXiv, and everyone else can participate in some sort of voting/commentary system; or (b) a new, more elitist publishing system is established, where bad authors and bad reviewers are excluded. Note that this will also impact newcomers to the field - ever since having a paper in a top AI conference became a potential money generator, endless hordes of grifters started flooding our field, and it will only get worse. These people have to be excluded.\n\nNone of these paths are particularly good, but they're probably better than what we have now.\n\nSometimes I half-jokingly say that democratization of AI has gone too far, and we need to bring back gatekeeping. I sorta stand by that - but we need a way to distinguish well-meaning beginners from clout-driven grifters. \nUnfortunately, the cultural zeitgeist still swings in the way of radical democratization - so any measures that might adversely impact those well-meaning beginners (who I absolutely want to support) will immediately get rejected by the more established and experienced people in the field.\n\nIt will get worse before it gets better. If it gets better.\n\nHopefully our superintelligent overlords arrive soon to fix this for us.",
  "avatar": "redtachyon/avatar/avatar.jpg",
  "avatarPath": "redtachyon/avatar/avatar.jpg",
  "images": [],
  "jsonFile": "redtachyon/tweets/1990485471038714097_2025-11-17-18-21-32.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "redtachyon"
}