{
  "id": "2005709923062092038",
  "url": "https://x.com/dwarkesh_sp/status/2005709923062092038",
  "timestamp": "2025-12-29T18:38:04.000Z",
  "capturedAt": "2026-01-01T23:47:13.128Z",
  "author": "Dwarkesh Patel @dwarkesh_sp",
  "authorName": "Dwarkesh Patel",
  "authorHandle": "@dwarkesh_sp",
  "text": "I’ve seen a lot of people misunderstand what we’re saying. Our claim is that in a world of full automation, inequality will skyrocket (in favor of capital holders).\n\nPeople aren't thinking about the galaxies. The relative wealth differences in a thousand years—or a million—will be downstream of who owns the first dyson swarms and space ships. And space colonization isn't bottlenecked by people’s preference for human nannies and waiters.\n\nSo even if you can make 10 million dollars a year as a nanny in the post-abundance future, or get a 10 million dollar charity handout, Larry Page’s million cyborg heirs can own a galaxy each.\n\nYou might think this is fine! Why is inequality intrinsically bad, especially if absolute prosperity for everyone goes up? Fair enough, but to me quadrillion fold differences in wealth between humans seem hard to justify in a world where AIs are doing all the work anyways - these disparities in wealth are not incentivizing hard work or entrepreneurship or creativity, which is what we use to justify inequality today.\n\nJust to recap, full automation kills the corrective mechanism on runaway capital accumulation - which is that you need labor to actually make productive use of your capital, thus driving up wages.\n\nSome people asked: why assume AGI leads to full automation? Maybe people will still prefer human nannies and waiters. Even if true, we think labor's share of GDP—which has been roughly 2/3 for centuries—would still likely collapse toward zero, massively increasing inequality. Here's why.\n\nIt sometimes happens that when machines are only slightly better than humans, people sometimes pay a premium for the human version. But once machines become much better, that preference disappears. When carriages were not much faster than being carried on a litter, the rich sometimes preferred the litter. Now they prefer the car. They might still have a chauffeur—but once self-driving vehicles are allowed to move far faster, human-driven cars may be relegated to a slow lane.\n\nIf the economy grows 100x, wages must also grow 100x for labor's share to stay at 2/3. But prices are relative—so this means human labor becomes 100x more expensive compared to AI-produced goods. A human-cooked meal costs 100x what the robot version does. For labor share to hold steady as that ratio grows to 1,000x, then 10,000x, the preference for human-made goods would have to become increasingly fanatical. And there's a second problem: the higher wages rise, the greater the incentive to develop machine substitutes for whatever services humans still provide. The premium on human labor is precisely what incentivizes its own replacement.\n\nJust to clarify a few other things:\n\n- “Piketty’s long run series are disputed.” We spend a long chunk of the essay explaining why Piketty is wrong about the past! But we’re arguing that the assumption he makes (specifically that labor and capital are substitutes) would be true of a world with advanced enough automation. We spend so much time rebutting his claims about the past because the wronger you think he was about the past, the more you think will change once his assumption comes true.\n- “A capital tax would lower growth.” Yes, as we point out, capital taxes incentivize consumption now instead of saving and investing for the future, at the margin. But if capital is the only factor of production, then it’s hard to come up with an inequality-capping tax that doesn’t lower growth.\n- “Capital can escape, both across time and space. This makes a wealth tax impractical.” We agree! As we say in the essay and in the tweet summary below, it would be really hard to implement Pikkety’s flagship solution (a high and progressive global wealth tax). You could go Georgist and try to tax land, but the natural resource share of income is only 5% and is likely to stay low until we hit “technological maturity” for reasons we explain in the essay. We don’t see any easy ways to avoid (literally) skyrocketing inequality - in fact, that’s what inspired us to write the essay and explain this problem in the first place.\n\nAlso, to address a subtext: I think the currently proposed California wealth tax is a very bad idea for many reasons. This essay is about inequality under full automation, not about how California can make its healthcare expenditures more sustainable.",
  "avatar": "dwarkesh_sp/avatar/avatar.jpg",
  "avatarPath": "dwarkesh_sp/avatar/avatar.jpg",
  "images": [],
  "jsonFile": "dwarkesh_sp/tweets/2005709923062092038_2025-12-29-18-38-04.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "dwarkesh_sp"
}