{
  "id": "2008207103467377108",
  "url": "https://x.com/BrianCAlbrecht/status/2008207103467377108/photo/1",
  "timestamp": "2026-01-05T16:00:58.000Z",
  "capturedAt": "2026-01-05T18:56:29.021Z",
  "author": "Brian Albrecht @BrianCAlbrecht",
  "authorName": "Brian Albrecht",
  "authorHandle": "@BrianCAlbrecht",
  "text": "Why would anyone continue to use humans when AI is vastly more productive?\n\nWe don’t need to speculate about what happens when massive efficiency differences exist between producers. We have that today. The inefficient producers still remain.\n\nThe most efficient white bread establishment (thinkk plant level productivity) produces 2x, 3x, even 6x as many loads of white bread as the least efficient with the same inputs. This is well documented across every country and industry studied.\n\nI’ll just pull up the 4 digit NAICS since that’s what’s publicly available. https://census.gov/data/experimental-data-products/dispersion-statistics-on-productivity.html… \n\nSort establishments by productivity. I’ll mostly use total factor productivity, TFP, but the same holds for labor productivity but is even more extreme. \n\nWhat’s the gap between the 75th and 25th percentile establishment? \n\nFor the median industry (orange line), it’s about 1.7x. These numbers are even more dramatic when you look at labor productivity, where the 75-25 gap is more like 3x. Workers at the 75th percentile establishment produce 3x as much as workers at the 75th.\n\n\nThat's just the median industry. If we think the tail industries matter, we should think of the \"dispersion of the dispersion.\" The blue region captures that For the 75th percentile industry (top of the blue region), the multiple is 1.9.  That’s only for 75-25 industries of the 75-25 gap, not really the tails.\n\nDo the same for 90-10. What’s the gap between the 90th percentile and 10th percentile establishment? \n\nThe median is now 3x, with the 90th percentile industry being 6x. 10% of manufacturing industries have a 6x gap in productivity.\n\n\nIn other words, 10% of establishments in 10% of industries are remaining open despite costs that are 6x as high. \n\nThis is what I mean when I say we don't need to speculate about how people use inefficient firms still. It happens today. \n\nAnd that’s in the US, where competition is as fierce as anywhere in the world. It still doesn’t weed out the low productivity firms. https://worksinprogress.co/issue/how-to-spot-a-monopoly/… We will return to why in a sec.\n\n“That’s all old white bread stuff. Not the technology of the future.” \n\nOkay. Let’s look at semiconductors (NAICS 3344). The closest thing the modern world has to robots building robots.\n\nThe 90-10 gap is 30-40x! \n\nThat’s true in measures of labor productivity and TFP, so it’s not about big capital firms. It's not about TSMC having the latest ASML machine.\n\n\n\nIf we can't eliminate productivity dispersion in semiconductor manufacturing (where advanced machines produce advanced machines in highly controlled environments) why would we expect AI to make all human labor obsolete?\n\nWhy don't the most productive firms drive out everyone else? Consumer preferences for heterogeneity matter. People pay extra for local establishments. Returns to scale matter, not every town can support a Walmart Supercenter. \n\nGeography matters.  Unless everyone is going to live in one giant city, there will always be millions of little establishments and most of them will be unproductive because they can be. (I don't see how this problem doesn't blow up when you start talking across galaxies, as @dwarkesh_sp wants us to.)\n\nThe same logic applies to AI. Yes, AI may be vastly more productive at specific tasks. But productivity differences don't automatically eliminate the less productive option.\n\nSocial science is built on the assumption there are some regulat patterns and ideas that allow you to understand across time and place.\n\nSure, it's always possible the future will be completely different. If that's true, I have no idea what to do to predict it. No one else does either.",
  "avatar": "briancalbrecht/avatar/avatar.jpg",
  "avatarPath": "briancalbrecht/avatar/avatar.jpg",
  "images": [
    "media/2008207103467377108_G96RHOpWEAAlzYP",
    "media/2008207103467377108_G96RMGsWoAEuvwa",
    "media/2008207103467377108_G96SYZGXIAA9r9k",
    "media/2008207103467377108_G96T4jDWcAASL1-"
  ],
  "jsonFile": "briancalbrecht/tweets/2008207103467377108_2026-01-05-16-00-58.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "briancalbrecht"
}