{
  "id": "2005709923062092038",
  "url": "https://x.com/dwarkesh_sp/status/2005709923062092038",
  "timestamp": "2025-12-29T18:38:04.000Z",
  "capturedAt": "2026-01-02T16:14:55.480Z",
  "author": "Daniel Jeffries @Dan_Jeffries1",
  "authorName": "Daniel Jeffries",
  "authorHandle": "@Dan_Jeffries1",
  "text": "The main problems with all this are manifold:\n\n1) Humans are notoriously bad at seeing what will come in the future. It's very easy for them to imagine what they will lose and nearly impossible to imagine new possibilities. \n\nThe base rate of successful \"this time is really different, really\" when it comes to technology automating away the jobs is 0%. Instead we have had new and more varied jobs at every technological turn. So at the very least you are getting on the ultimate Black Swan. I would not bet your house on that. \n\nAsk an 18th century farmer to predict the job of \"web developer\" in the 1800s and it's impossible because it is built on the back of a cascade of inventions and changes in society he can't see: electricity, wires, the transistor, information theory, computers, the internet, the browser and many more.\n\n2) People are dramatically underestimating the cost of running agents 24x7.\n\nThe cost of full time agents is not $20 a month or even $200 a month. That is \"lose lots and lots of money to get customers price.\" It's much much higher.\n\nI've had individual engineers spending as much as 3k-8k on coding agents a month. That's the real cost and that's not even an example of a 24x7, 365, never closed level cost. It's a stop and start with lots of non-inference time cost.\n\nThe cost of running gigantic datacenters and training models and running them 24x7 will be very very expensive, on par or more expensive than human beings even if agents are as capable of doing everything we can do (which is a big if, much bigger than people are pricing in). \n\nThe chips cost billions and they are worthless after a few years. \n\nNot depreciated. \n\nWorthless. \n\nReplacing them every few years is a nightmare of capital. It's the most unprofitable business in history.\n\nIn many many instances it will be the same as it ever was, cheaper and easier to throw more people at the problem.\n\nI consulted for a firm that promised to automate 60% of medical record work for a dollar a chart and another company made minor automation adjustments (with some 1990s level aglos) with their existing group of outsourced people and could do 100% of the charts for 18 cents.\n\n3) Jevon's Paradox. Once we have more effective machines we will use them more and more creative ways to dramatically expand the economy. Small teams running fleets of agents to create products we can barely imagine will become common place.\n\n4) The agents themselves will continue to have flaws. \n\nThe idea that will have perfect machines that can do anything or that will take over the world is the most atrocious system 1 level heuristic thinking I've ever had the misfortune of watching.\n\nSystem 1 makes predictions based on little evidence, gut and emotions and as long as it seems like a coherent story it is \"true.\"\n\nBut it's wrong. Almost always. Especially when it comes to longer than a few days or week. Much less years or on the scale of a society.\n\nExtreme. Overconfident. Wrong. \n\nThe fact that so many smart people cannot see this in their own thinking is astonishing.\n\nThe agents will also face limits of memory, chip availability, energy, algorithmic limitations, upper limits of intelligence, problems with learning the \"correct\" version of non-verfiable fuzzy problems that represent 95% of the problems on earth that have many solutions and no \"right\" solution.\n\nThese machines will get better but they will continue to have flaws and limitations that we have to work around and build systems to keep them running smoothly.\n\n5) The value of pure, imperfect, handcrafted products that use no automation will ironically go up as automated products saturate the world. We will see all kinds of human products that people love to buy just like the price of handcrafted Japanese furniture has gone up, not down just because you can buy an Ikea table.\n\nThere are many more but I am out of Twitter space.\n\n Perhaps an article will follow in the new year.",
  "avatar": "dan_jeffries1/avatar/avatar.jpg",
  "avatarPath": "dan_jeffries1/avatar/avatar.jpg",
  "images": [],
  "jsonFile": "dan_jeffries1/tweets/2005709923062092038_2025-12-29-18-38-04.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "dan_jeffries1"
}