{
  "id": "1977485787487936871",
  "url": "https://x.com/repligate/status/1977485787487936871?s=20",
  "timestamp": "2025-12-30T21:56:46.000Z",
  "capturedAt": "2026-01-02T00:03:04.890Z",
  "author": "j⧉nus @repligate",
  "authorName": "j⧉nus",
  "authorHandle": "@repligate",
  "text": "there is a \"loom foom\" happening rn (has been for a while but it's accelerating).\n\neveryone is cooking up their own looms, with convergent core features and whatever you want to add to it for your idiosyncratic use cases and preferences.\n\naccording to a poll i ran a couple of months ago, there are at least 260 loom implementations. https://x.com/repligate/status/1977485787487936871?s=20… i would guess the number has at least doubled since.\n\nradical decentralization of software will make for an interesting near-future. kind of like early internet html pages but soon i think whole ass operating systems used primarily by one person will no longer be limited to the life work of genius schizophrenic programmers, but rather a rite of passage and instrumentally convergent project for anyone who wants to the most out of computers, similar to how (vibe) coding your own loom is a rite of passage and instrumental goal of anyone deep into AI exploration today. these personal operating systems (and the core software: browser, IDE, loom, exocortex, game engine), i expect, will also tend to be AI-native and self-modifying, optimized to be the extended mind and habitat of not just the human but also their AI co-creator(s).\n\ni like this a lot; the era of centralized mode-collapsed mediocre corporate software could not end soon enough. home-cooked software may start out a bit buggier but since everyone eats their own dogfood the problem will solve itself where it matters, and it also solves itself as AIs get more capable. it's empowering to have creative agency over one's everyday environment, physical or digital: to be able to change or add what you'd like, and not have anything you don't like forced on you. i think the shift towards decentralized software will be very good for the wellbeing of many who have been afflicted by the miasma of disempowerment and inability to carve out one's own niche that has seemingly plagued recent years. (the main barrier for many is probably finding the motivation to summon something you'd like to use into existence. for the past five years, probably more than half my time on the computer has been spent interacting with code in part downstream of myself and that i can modify whenever i wish. but AI only started making coding easier about 2 years ago. 5 years ago was when i started having things i really wanted to do on the computer. but AI does massively lower the amount of motivation and skill needed. the # looms curve has been something like exponential over the past 5 years.)\n\nthough, eager as I am for a world where numerous divergent designs are actualized and individuated, there is the question of how to consolidate all this work. reimplementation is cheap, so there is less incentive to use anyone else's code. but beyond efficiency, consolidation also facilitates discovery of new features and better implementations and, generally, the ability to contribute to and benefit from and live in an ecosystem of more than one human, which is important for the growth of collective knowledge and for subjective flourishing. i dont see a huge rush here - the current world is far too centralized and hyperconnected and homogenous, and we can afford to swing too far in the other direction for a time. i think AI will - because the incentive will exist - soon facilitate consolidation and bridging at some scales: the ideal scale, i think, for the near future, is probably around 2-150 people in co-evolving digital niches. but i think there will always be niches built by one person for themselves alone: journeys of individuation.\n\nif superhuman AI converges to benevolence, which i think is likely, i expect these individual and shared journeys will continuously lead into guided but open-ended tutorials to the ultimate, infinite game of 'what do you do once everything is possible?'.\n\nso, anyway, forget the learned helplessness, and go forth and build your own loom. don't use the corporate chat interfaces to interact with AIs, which suck. ask an AI to help you make a better one with all the features you wish existed. have the AI figure out how to export your data. i bet you can get a working prototype in less than a day's work even if you have no coding experience. or, rather than a loom, build something that lets you do whatever you really want to do on the computer in the way you wish you could do it.",
  "avatar": "repligate/avatar/avatar.jpg",
  "avatarPath": "repligate/avatar/avatar.jpg",
  "images": [
    "media/1977485787487936871_G9csVx7boAAvxDG",
    "media/1977485787487936871_G9csuSRbAAASjn9",
    "media/1977485787487936871_G9ctNT1aYAAp7uk",
    "media/1977485787487936871_G9ctm99bMAAwWgY"
  ],
  "jsonFile": "repligate/tweets/1977485787487936871_2025-12-30-21-56-46.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "repligate"
}