{
  "id": "2001643126784471085",
  "url": "https://x.com/PeterSchiff/status/2001643126784471085",
  "timestamp": "2025-12-16T22:29:02.000Z",
  "capturedAt": "2025-12-18T18:42:01.933Z",
  "author": "Peter Schiff @PeterSchiff",
  "authorName": "Peter Schiff",
  "authorHandle": "@PeterSchiff",
  "text": "Socialist Bernie Sanders is upset that rich people might get richer by developing AI. Apparently, the real tragedy isn’t poverty or scarcity, but the possibility that someone might profit while making everyone else’s life easier.\n\nIf AI raises profits by raising productivity, producing more and better goods at lower prices, then consumers are the real winners. But Sanders isn’t worried about consumers. He’s worried about jobs, as if jobs are some moral good in and of themselves.\n\nJobs are not the goal. They’re the cost. We don’t work because work is fun. We work because we want the goods and services that work produces. If technology lets us get those things without the work, that’s not exploitation, it’s progress.\n\nEvery worker is also a consumer. And consumers benefit when prices fall. When goods and services cost less, people don’t have to work as hard to afford them. If prices fall far enough, people barely have to work at all. That’s not a dystopia, that’s the logical endpoint of productivity.\n\nAs long as goods and services are scarce, some work will always need to be done. When technology eliminates one job, it frees up labor to do something else. The less labor required to meet our needs, the more leisure society enjoys and the higher our collective standard of living. That’s how civilization advances.\n\nBut if Sanders is right, if anything that eliminates jobs is bad, then we should be consistent. Let’s not just smash all the robots and ban AI, but destroy every labor-saving device ever invented since the Stone Age. That way every one of us can go back to foraging, hauling water, building straw huts by hand, and stitching clothes from the hides of animals we kill ourselves with hand-carved spears.\n\nEveryone will have a job working from sunrise to sunset, every day. No one will be unemployed. No one will retire. If you don’t work, you die.\n\nBut at least Bernie Sanders will be happy, as no one will be getting rich off us.",
  "avatar": "peterschiff/avatar/avatar.jpg",
  "avatarPath": "peterschiff/avatar/avatar.jpg",
  "images": [
    "media/2001643126784471085_3lmuPWBZ2YbtN12r.jpg"
  ],
  "jsonFile": "peterschiff/tweets/2001643126784471085_2025-12-16-22-29-02.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "peterschiff"
}