{
  "id": "2008234588406202616",
  "url": "https://x.com/dwarkesh_sp/status/2008234588406202616/photo/1",
  "timestamp": "2026-01-05T16:00:58.000Z",
  "capturedAt": "2026-01-05T18:56:33.190Z",
  "author": "Dwarkesh Patel @dwarkesh_sp",
  "authorName": "Dwarkesh Patel",
  "authorHandle": "@dwarkesh_sp",
  "text": "Why didn't that save the horse population once the car revolution happened?\n\nIn reality, the transaction costs of having horses poop on and slow down the roads are too high for the theoretical benefits of comparative advantage (or consumer preferences or returns to scale limitations) to actually manifest themselves. \n\nSure, there's still a non-neglibile horse population which we use for entertainment. But a horse in 1910 shouldn't be terribly excited about the developments in the horse labor market.\n\nI would expect something similar for humans once AIs and robots are advanced enough. We can't speak in their neuralese and keep up with their speed, and our subsistence wages are 1000s of times higher per task, etc.\n\nI found it interesting to learn about all these examples of low productivity producers still retaining some market share. \n\nBut low productivity producers do in fact go out of business all the time! Just because there's surprising reasons a particular low productivity firm is still is business doesn't mean that the particular low productivity producers we're interested in (human laborers) are likely to stay in business.\n\nCurious if I misunderstood your argument @BrianCAlbrecht. If so, eager to better understand it :)",
  "avatar": "dwarkesh_sp/avatar/avatar.jpg",
  "avatarPath": "dwarkesh_sp/avatar/avatar.jpg",
  "images": [
    "media/2008234588406202616_G96qYg5W4AEStrC",
    "media/2008234588406202616_G96RHOpWEAAlzYP",
    "media/2008234588406202616_G96RMGsWoAEuvwa",
    "media/2008234588406202616_G96SYZGXIAA9r9k",
    "media/2008234588406202616_G96T4jDWcAASL1-"
  ],
  "jsonFile": "dwarkesh_sp/tweets/2008234588406202616_2026-01-05-16-00-58.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "dwarkesh_sp"
}