{
  "id": "2001011042642505833",
  "url": "https://x.com/LarAtLarian/status/2001011042642505833",
  "timestamp": "2025-12-16T19:26:24.000Z",
  "capturedAt": "2025-12-18T16:53:51.798Z",
  "author": "Elven Maid Inn @elvenmaidinn",
  "authorName": "Elven Maid Inn",
  "authorHandle": "@elvenmaidinn",
  "text": "I will expand on my point:\n\n1) You are using AI in your daily life. Search engines are AI-powered, your phone camera is AI-powered (sorry, you haven't become better at taking photos-smudges, blinks-all fixed by AI), Alexa? Siri? Google Assistant? Guess what, they are powered by AI. Netflix, YouTube, Twitch-all use AI to highlight content you're interested in. Google Maps and most navigation apps are now powered by AI to calculate your route. Spam filters, health and fitness trackers, even your online planner-all powered by AI.\n\nYou use AI every day to make your life easier and find information faster, you're just too proud to admit it.\n\n2) Witch hunts like with Larian Studios will cause only one thing: they will never tell you they're using AI. You think silly outrage will stop anyone from making their work easier? \"Bitch please.\" I've been here when Photoshop was considered a \"real art killer\" frowned upon by traditional artists and discarded as \"not real art.\" The majority of art is now made using computer tools.\n\nI remember when tens of thousands of Kodak shops closed down when traditional photography was replaced by digital cameras, millions of people lost their jobs, including me. I don't remember outrage back then.\n\nLet's face it, AI is here whether you like it or not; it will not go away because it makes life easier.\n\nWe can be civil about it, accept that studios are using AI, and appreciate that they are willing to be honest with us, or we can fuel witch hunts that will cause studios to be completely silent about any use of AI in their work.\n\nThis is no longer Kansas, Dorothy.",
  "avatar": "elvenmaidinn/avatar/avatar.jpg",
  "avatarPath": "elvenmaidinn/avatar/avatar.jpg",
  "images": [],
  "jsonFile": "elvenmaidinn/tweets/2001011042642505833_2025-12-16-19-26-24.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "elvenmaidinn"
}