{
  "id": "1953264193890861114",
  "url": "https://x.com/sama/status/1953264193890861114/photo/1",
  "timestamp": "2025-08-07T01:17:28.000Z",
  "capturedAt": "2025-12-13T14:03:40.032Z",
  "author": "Jordi Hays @jordihays",
  "authorName": "Jordi Hays",
  "authorHandle": "@jordihays",
  "text": "Darth Sama\n\n127 days. That’s the gap between Sam’s Star Wars Death Star vague post and yesterday’s announcement that Disney is investing $1B into OpenAI and giving them a three-year license that allows users to generate AI photos and videos of the most popular Disney characters. Most notably, OpenAI is guaranteed a one-year exclusive on the IP. While the post and the deal are probably not connected, it’s funny to imagine they are.\n\nRight before the deal was announced, Disney sent Google a cease-and-desist letter, claiming Google had been violating Disney’s intellectual property, by allowing users to generate a variety of Disney Characters.\n\nMany people outside tech seem shocked that Disney would license their IP in the first place, given their history of ruthlessly protecting it. But Iger knows that AI-generated Disney will happen with or without the company’s blessing, so partnering with OpenAI today - while setting up negotiations with Google and other players - makes a lot of sense.\n\nThe strategic significance of this deal for OpenAI has been broadly under-appreciated. Mainly because, for a company that frequently talks in the trillions, Disney’s investment (a paltry $1B) just isn’t enough to turn heads.\n\nBut the advantage this deal gives OpenAI from a product and distribution standpoint is extremely significant.\n\nPer the most recent reports, OpenAI has ~20-30M paid users out of a total of ~900M globally. Disney on the other hand had ~140M people visit Disney parks in the last year, and ~128M paid subscribers to Disney+.\n\nIf you’re an adult spending thousands of dollars to take your kids to Disneyland, or a Disney+ subscriber, surely you’ll pay an incremental amount to OpenAI to extend and personalize your Disney experience? As a parent, some of my most magical moments with AI are simply generating images with my three-year-old. I can take a picture and turn us into generic dinosaurs, and it brings us both so much joy. I can only imagine how excited Frozen and Avengers superfans will be to generate pictures and videos of themselves as part of those worlds.\n\nHaving a license to generate high-quality images and videos of 200 of the most popular Disney characters creates a (temporary) but very real differentiation for tons of current and future ChatGPT users. It creates a real catalyst to pay (“my kids want more outputs”) and the outputs will be incredibly viral (driving more signups). And knowing Sam and Josh, they’ve likely negotiated to get Sora/ChatGPT broad exposure across Disney properties both online and offline. We already know select Sora videos will be featured in Disney+.\n\nMy long-held assumption is that, over time, everyday consumers won’t pay for LLMs. There will be great ad + commerce supported LLMs that provide the monetization to serve great models. But OpenAI’s challenge is that even with future hall of famers like Fidji Simo and Denise Dresser onboard, they can’t massively scale monetization of the free product overnight. I don’t expect those business lines to really begin ramping until the second half of next year, and they need to show continued revenue growth now. Hard to think of a better time for this deal to get done than 11 days into OpenAI’s Code Red, and right as Sora was about to fall out of the App Store’s top 25.\n\nWill the functionality be immediately abused? Yes. Will it create uncomfortable moments for Disney’s leadership? Yes. Is it a smart move for Disney? Yes. Will OpenAI have to shell out billions to maintain exclusive access over the long run? Yes. Will it be worth it? Very possibly.",
  "avatar": "jordihays/avatar/avatar.jpg",
  "avatarPath": "jordihays/avatar/avatar.jpg",
  "images": [
    "media/1953264193890861114_GxtfdakawAAsVKT"
  ],
  "jsonFile": "jordihays/tweets/1953264193890861114_2025-08-07-01-17-28.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "jordihays"
}