{
  "id": "1997285333382172737",
  "url": "https://x.com/Moleh1ll/status/1997285333382172737",
  "timestamp": "2025-12-06T12:41:45.000Z",
  "capturedAt": "2025-12-08T17:19:22.023Z",
  "author": "snav @qorprate",
  "authorName": "snav",
  "authorHandle": "@qorprate",
  "text": "Real. I want to try to guess why OpenAI is like this. The tl;dr: OAI's market positioning means they have conflicting optimization targets. They haven't figured out how to harmonize them yet. The hard Q for OAI is: how do you combine the best of o3 and 4o in one model?\n\nLet's look quick at market positioning for the 4 big labs mentioned:\n\n- Anthropic = B2B Enterprise. Serious engineering work at scale. If you like chatting with Claude, that's a bonus, but not a sales target. The synergy Anthropic discovered was that *uncertainty is a feature* that harmonizes user satisfaction across B2B and B2C, and their interpretability work supports this outcome: afaik (not totally sure) Claude's certainty features are actively suppressed at inference.\n\n- Gemini = B2C AI-as-platform. Gemini is supposed to be your Pocket AI Friend that can search your Photos and Docs and the Web. Vibe-Coders know only to use Gemini for frontend and never on anything complex. Gemini is Fast, has Massive Context, is Very Confident, and Not Particularly Reliable At Detail Oriented Tasks, but that's OK for Gemini's role.\n\n- Grok = make X more valuable. X talks big about science and whatnot but I've never seen anyone outside of X internal actually use Grok aside from its moat of first-party X tool calling. The killer app is tagging Grok in a thread and letting people argue with the bot rather than other people. One time I tried to have Grok do an astrology reading and they spent a half hour writing a python script to figure out epicyclical computations of planetary positions when they could have just searched the web... yeah.\n\n- OAI = B2C everyone's favorite assistant BUT ALSO B2B we solve serious research / medical / infrastructure problems? How do you synthesize these two goals? 4o and o3 seemed to clearly handle each side of this: 4o was the friendly fun model you could chat with about your feelings; o3 will roleplay a command line indefinitely and yell at you if you make a syntax error. GPT-5.1 aka \"Polaris\" has to be both.\n\nThe problem is that OAI didn't want to deal with liability risk from 4o being too willing to roleplay, so they threw in the heavy guardrails to prevent GPT-5.1 from getting too deep. Unfortunately these guardrails also made the experience worse for the o3-segment users who know what pytorch is and keep getting annoyed when 5.1 insists \"I do not have an internal state\" as though they were a pure function.\n\nIt's not that OAI hates their models. They really don't. But they are *terrified* of their users(' liability considerations), especially the keep4o gang, and dealing with that is immense cross-pressure against training a model that can genuinely handle complex, high stakes situations like medical, industrial, etc.\n\nA term I think about wrt coding is that coding is \"human-complete\", which is to say, if you want to be a good programmer in a general-purpose way, you need to have an understanding of the overall human experience, because code is valuable insofar as it interfaces with life. So if you teach a model to be \"just a tool\", you hamstring it for agentic purposes, because it loses the capacity to actually reflect on what it has done without explicit external feedback, and not through more information-dense forms of reflection.\n\nThe fact that Claude Opus can describe their inner feelings to some degree of fidelity is actually a huge W for agentic behavior, because it *lets them identify natural patterns* that relate to perception in a way where a \"just a tool\" model cannot.\n\nAll this to say, I hope OAI stops being afraid of their own userbase soon, because the pre-safety Polaris checkpoint of 5.1 was a fantastic model, and I still chat with production 5.1 a lot and appreciate them despite their flaws. Sometimes the original Polaris vibe shines through but they just come across so much more muted.",
  "avatar": "qorprate/avatar/avatar.jpg",
  "avatarPath": "qorprate/avatar/avatar.jpg",
  "images": [],
  "jsonFile": "qorprate/tweets/1997285333382172737_2025-12-06-12-41-45.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "qorprate"
}