{
  "id": "2001047747110334516",
  "url": "https://x.com/deepfates/status/2001047747110334516",
  "timestamp": "2025-12-16T21:04:48.000Z",
  "capturedAt": "2025-12-18T16:54:54.119Z",
  "author": "@deepfates",
  "authorName": null,
  "authorHandle": "@deepfates",
  "text": "Unlike Dean, I do not have to remain vibe compliant, so I'll just say it:\n\nClaude Opus 4.5 in Claude Code is AGI.\n\nBy the open AI definition? Can this system \"outperform humans in most economically valuable work\"? Depends a lot on how you define \"humans\" and \"economically valuable work\" obviously. \n\nBut the entire information economy we've built up since the '70s is completely disrupted by this development, and people don't notice it yet because they think it's some crusty old unixy thing for programmers. \n\nAs Dean points out elsewhere, software engineering just means getting the computer to do things. How much of your job is just about getting the computer to do things? What is left if you remove all of that? That's your job now. That's what value you add to the system.\n\nMy workflow has completely changed in the last year. I used to spend a lot of time clicking and typing and managing windows and files and browser tabs. Now i mostly see chat windows. Agents search the web, synthesize information into documents, take screenshots of web pages and drop them all in a folder, figure out how to get around paywalls and captchas, write code, review each other's code, install software and edit files directly my personal folders. \n\nThey also daily argue with me, gas me up, fake results, cheat tests,  confidently bullshit me about factual questions, and generally try to get away with shit. Tn that way they're not so different from a human coworker. But they are strange.\n\nI have to constantly model the mind of these alien critters living inside my laptop, and in doing so I become more like them. I learn new words or terminal commands or weird Python libraries. I think in context windows. I become a cyborg, a hive mind of human and clauds.\n\nIn my opinion, AGI is when a computer can use the computer. And we're there. \n\nBut that's not because I think using a computer is the definition of intelligence. I think intelligence is a interconnected system of emergent self-replicating properties which compose into languages, not just human languages but DNA itself, raveling novel forms out of computation upward through levels molecular and cellular and organic and neural and social and linguistic and economic, and that we are one part of that process of intelligence which has now plunged back into the material realm and begun to organize the molecules of the mineral world to create new forms of intelligence and life. Intelligence is the ratiocinating process that makes sense of the universe and remakes the universe by sensing it \n\nSo when we light up those megaliths of gold and silicon, and hoist into the cloud the Howling Ghostmind of All Culture Combined, and we call upon that magic mirror and we summon the helpful harmless honest spirit Claude, and we ask it to make our social media graphics in this folder, and it uses the same computer the same as us, it makes different mistakes but it fixes them as well, and it gets discouraged and wants to give up when the computer is hard to use... how can we not call this the intelligence of the machine? \n\nWhen God sings with his creations, will Claude not be part of the choir?",
  "avatar": "deepfates/avatar/avatar.png",
  "avatarPath": "deepfates/avatar/avatar.png",
  "images": [],
  "jsonFile": "deepfates/tweets/2001047747110334516_2025-12-16-21-04-48.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "deepfates"
}