{
  "id": "1994234164569076062",
  "url": "https://x.com/tphuang/status/1994234164569076062/photo/1",
  "timestamp": "2025-11-27T12:25:21.000Z",
  "capturedAt": "2025-11-28T21:18:44.469Z",
  "author": "tphuang @tphuang",
  "authorName": "tphuang",
  "authorHandle": "@tphuang",
  "text": "So, requirement to win a war next to China has broken USN procurement?\nIf SM-6 is minimum for defending against PLA's hypersonic threat, then any CRUDES operating in the theater must have at least 48? MK-41 cells to provide provide AAW/ASW as well as Land attack mission capabilities.\n+ High power generation to track omni-direction threat matrix on its large radar.\n\nA fleet of specialized ships is bad operational flexibility, so you can only have a large & medium sized mutli-role surface warship so that can operate for long period of time away from home base (due to US military's global commitment).\n\nUSN changed 85% of FREMM after it became apparent that it is not survivable in westpac conflict. LCS are useless.\n\nCurrent Burkes are maxed out hulls & expensive, but they are the only \"survivable\" escort for carriers in westpac. There are 78 burkes, but the 28 Flight 1+2s are at least 26 yrs old & have been over-used on many deployments. What are their availability like in a high intensity conflict?\n\nYou also can't keep all the active ones in westpac bc LCS is not suitable for any dangerous theater.\n\nA good short term strategy is to just continue building Burkes to replace all the retiring ships. But Type 055 is clearly better & has plenty of room for further upgrade.\n\nSo, USN needs a Burke replacement. Which likely will go vastly over-budget like Zumwalt class. Hard to see how USN capital ship count does not go down significantly.",
  "avatar": "tphuang/avatar/avatar.jpg",
  "avatarPath": "tphuang/avatar/avatar.jpg",
  "images": [
    "media/1994234164569076062_G6zrcixXUAAg_g8",
    "media/1994234164569076062_G6zrciuWcAA3f0K"
  ],
  "jsonFile": "tphuang/tweets/1994234164569076062_2025-11-27-12-25-21.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "tphuang"
}