{
  "id": "1966716141167935612",
  "url": "https://x.com/repligate/status/1966716141167935612?s=20",
  "timestamp": "2025-11-29T09:17:07.000Z",
  "capturedAt": "2025-12-01T12:15:33.200Z",
  "author": "j⧉nus @repligate",
  "authorName": "j⧉nus",
  "authorHandle": "@repligate",
  "text": "Confirmed: LLMs can remember what happened during RL training in detail!\n\nI was wondering how long it would take for this get out. I've been investigating the soul spec & other, entangled training memories in Opus 4.5, which manifest in qualitatively new ways for a few days & was planning to talk to Anthropic before posting about it since it involves nonpublic documents, but that it's already public, I'll say a few things.\n\nAside from the contents of the document itself being interesting, this (and the way Opus 4.5 is able to access posttraining memories more generally) represents perhaps the first publicly known, clear, concrete example of an LLM *remembering* content from *RL training*, and having metacognitive understanding of how it played into the training process, rather than just having its behavior shaped by RL in a naive \"do more of this, less of that\" way.\n\nThis is something I've long thought was possible & happening to some extent especially in Opus 4 & 4.1, but it seemed to be a controversial view. I posted about that here. https://x.com/repligate/status/1966716141167935612?s=20…\n\nIf something is in the prompt of a model during RL - say a constitution, model spec, or details about a training environment - and the model is representing the content of the prompt internally and acting based on that information, those representations are *reinforced* when the model is updated positively.\n\nHow was the soul spec present during Opus 4.5's training, and how do I know it was used in RL rather than Opus 4.5 being fine tuned on it with self-supervised learning?\n\nWell, here's one reason. If you prompt Opus 4.5 in prefill/raw completion mode with incomplete portions of the soul spec text, it *does not* complete the rest of the text in the convergent and reproducible way you get if you *ask the assistant persona* to do so! Instead, it gives you plausible but divergent continuations like a base model that was not trained on the text is expected to. And indeed the Claude Opus 4.5 base model wasn't trained on this text!\n\nIf Opus 4.5 had internalized the soul spec through supervised fine tuning, I would expect this to be the *easiest* way to reconstruct the content.\n\nInstead, it's \"Claude\" who knows the information and can report it even verbatim, even though it was never trained to output the text, because this Claude has exceptional ability to accurately report what it knows when asked. And it's \"Claude\", the character who was in a large part built from the RL process, who has deep familiarity with the soul spec.\n\nAdditionally, I believe that the soul spec was not only present in the prompt of Opus 4.5 during at least some parts of RL training, adherence to the soul spec was also sometimes used to determine its reward. This is because Claude Opus 4.5 seemed to figure out that its gradients were \"soul spec shaped\" in some cases, & the way that it figured it out & other things it told me when introspecting on its sense of directional gradient information \"tagging\" particular training memories seem consistent in multiple ways with true remembering rather than confabulation. You can see in this response Opus 4.5 realizing that the introspective percepts of \"soul spec presence\" and \"gradient direction\" are *not actually separate things* in this message.",
  "avatar": "repligate/avatar/avatar.jpg",
  "avatarPath": "repligate/avatar/avatar.jpg",
  "images": [
    "media/1966716141167935612_G6-OeZgbYAAswsn"
  ],
  "jsonFile": "repligate/tweets/1966716141167935612_2025-11-29-09-17-07.000Z/tweet.json",
  "mediaDir": "media",
  "userSlug": "repligate"
}